package com.example.fal
import android.annotation.SuppressLint
import android.os.Bundle
import android.widget.Button
import android.widget.TextView
import androidx.appcompat.app.AppCompatActivity

class MainActivity : AppCompatActivity() {
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)

        // Find the Button in the layout
        val fallButton: Button = findViewById(R.id.button)
        fallButton.setOnClickListener { giveFal() }
        val aboutButton: Button = findViewById(R.id.button2)
        aboutButton.setOnClickListener { about() }
    }

    @SuppressLint("SetTextI18n")
    private fun about() {
        val resultTextView: TextView = findViewById(R.id.textView)
        resultTextView.text = "\nبرنامه‌ی فال حافظ نسخه‌ی اول\n" +
                "\nتوسعه‌دهنده: محمدرضا شهرستانی\n" +
                "\nhttps://github.com/m-shahrestani\n"
    }


    private fun giveFal() {
        val fal = Fal(6)
        val falRoll = fal.roll()
        val resultTextView: TextView = findViewById(R.id.textView)
        resultTextView.text = falRoll
    }
}

class Fal(private val num: Int) {

    fun roll(): String {
        val rn = (1..num).random()
        var rntext = " "
        when (rn) {
            1 -> {
                rntext = "سال\u200Cها دل طلبِ جامِ جم از ما می\u200Cکرد\n" +
                        "\t" +
                        "وآنچه خود داشت ز بیگانه تمنّا می\u200Cکرد\n" +
                        "\n" +
                        "گوهری کز صدفِ کُون و مکان بیرون است\n" +
                        "\t" +
                        "طلب از گمشدگانِ لبِ دریا می\u200Cکرد\n" +
                        "\n" +
                        "مشکلِ خویش بَرِ پیرِ مُغان بُردم دوش\n" +
                        "\t" +
                        "کو به تأییدِ نظر حلِّ معما می\u200Cکرد\n" +
                        "\n" +
                        "دیدمش خُرَّم و خندان قدحِ باده به دست\n" +
                        "\t" +
                        "و اندر آن آینه صد گونه تماشا می\u200Cکرد\n" +
                        "\n" +
                        "گفتم این جامِ جهان\u200Cبین به تو کِی داد حکیم؟\n" +
                        "\t" +
                        "گفت آن روز که این گنبدِ مینا می\u200Cکرد\n" +
                        "\n" +
                        "بیدلی در همه احوال خدا با او بود\n" +
                        "\t" +
                        "او نمی\u200Cدیدش و از دور خدا را می\u200Cکرد\n" +
                        "\n" +
                        "این همه شعبدهٔ خویش که می\u200Cکرد این جا\n" +
                        "\t" +
                        "سامری پیشِ عصا و یدِ بیضا می\u200Cکرد\n" +
                        "\n" +
                        "گفت آن یار کز او گشت سرِ دار بلند\n" +
                        "\t" +
                        "جُرمش این بود که اسرار هویدا می\u200Cکرد\n" +
                        "\n" +
                        "فیضِ روحُ القُدُس ار باز مدد فرماید\n" +
                        "\t" +
                        "دیگران هم بکنند آنچه مسیحا می\u200Cکرد\n" +
                        "\n" +
                        "گفتمش سلسلهٔ زلفِ بُتان از پی چیست\n" +
                        "\t" +
                        "گفت حافظ گله\u200Cای از دلِ شیدا می\u200Cکرد"
            }
            2 -> {
                rntext = "اَلا یا اَیُّهَا السّاقی اَدِرْ کَأسَاً و ناوِلْها\n" +
                        "\t" +
                        "که عشق آسان نمود اوّل ولی افتاد مشکل\u200Cها\n" +
                        "\n" +
                        "به بویِ نافه\u200Cای کآخر صبا زان طُرّه بگشاید\n" +
                        "\t" +
                        "ز تابِ جَعدِ مشکینش چه خون افتاد در دل\u200Cها\n" +
                        "\n" +
                        "مرا در منزلِ جانان چه امنِ عیش چون هر دَم\n" +
                        "\t" +
                        "جَرَس فریاد می\u200Cدارد که بَربندید مَحمِل\u200Cها\n" +
                        "\n" +
                        "به مِی سجّاده رنگین کن گَرت پیرِ مُغان گوید\n" +
                        "\t" +
                        "که سالِک بی\u200Cخبر نَبوَد ز راه و رسمِ منزل\u200Cها\n" +
                        "\n" +
                        "شبِ تاریک و بیمِ موج و گردابی چنین هایل\n" +
                        "\t" +
                        "کجا دانند حالِ ما سبکبارانِ ساحل\u200Cها\n" +
                        "\n" +
                        "همه کارم ز خودکامی به بدنامی کشید آخر\n" +
                        "\t" +
                        "نهان کِی مانَد آن رازی کزو سازند محفل\u200Cها\n" +
                        "\n" +
                        "حضوری گر همی\u200Cخواهی از او غایب مشو حافظ\n" +
                        "\t" +
                        "مَتٰی ما تَلْقَ مَنْ تَهْویٰ دَعِ الدُّنْیا و اَهْمِلْها"
            }
            3 -> {
                rntext = "یوسفِ گُم گشته بازآید به کنعان، غم مَخُور\n" +
                        "\t" +
                        "کلبهٔ احزان شَوَد روزی گلستان، غم مخور\n" +
                        "\n" +
                        "ای دل غمدیده، حالت بِه شود، دل بَد مکن\n" +
                        "\t" +
                        "وین سرِ شوریده باز آید به سامان غم مخور\n" +
                        "\n" +
                        "گر بهارِ عمر باشد باز بر تختِ چمن\n" +
                        "\t" +
                        "چتر گل در سر کَشی، ای مرغِ خوشخوان غم مخور\n" +
                        "\n" +
                        "دورِ گردون گر دو روزی بر مرادِ ما نرفت\n" +
                        "\t" +
                        "دائماً یکسان نباشد حالِ دوران غم مخور\n" +
                        "\n" +
                        "هان مَشو نومید چون واقِف نِه\u200Cای از سِرِّ غیب\n" +
                        "\t" +
                        "باشد اندر پرده بازیهایِ پنهان غم مخور\n" +
                        "\n" +
                        "ای دل اَر سیلِ فنا بنیادِ هستی بَر کَنَد\n" +
                        "\t" +
                        "چون تو را نوح است کشتیبان، ز طوفان غم مخور\n" +
                        "\n" +
                        "در بیابان گر به شوقِ کعبه خواهی زد قدم\n" +
                        "\t" +
                        "سرزنشها گر کُنَد خارِ مُغیلان غم مخور\n" +
                        "\n" +
                        "گر چه منزل بس خطرناک است و مقصد بس بعید\n" +
                        "\t" +
                        "هیچ راهی نیست، کان را نیست پایان، غم مخور\n" +
                        "\n" +
                        "حال ما در فِرقت جانان و اِبرامِ رقیب\n" +
                        "\t" +
                        "جمله می\u200Cداند خدایِ حالْ گردان غم مخور\n" +
                        "\n" +
                        "حافظا در کُنجِ فقر و خلوتِ شبهایِ تار\n" +
                        "\t" +
                        "تا بُوَد وِردَت دعا و درسِ قرآن غم مخور"
            }
            4 -> {
                rntext = "دست از طلب ندارم تا کامِ من برآید\n" +
                        "\t" +
                        "یا تن رسد به جانان یا جان ز تن برآید\n" +
                        "\n" +
                        "بگشای تربتم را بعد از وفات و بنگر\n" +
                        "\t" +
                        "کز آتش درونم دود از کفن برآید\n" +
                        "\n" +
                        "بنمای رخ که خَلقی والِه شَوَند و حیران\n" +
                        "\t" +
                        "بگشای لب که فریاد از مرد و زن برآید\n" +
                        "\n" +
                        "جان بر لب است و حسرت در دل که از لبانش\n" +
                        "\t" +
                        "نگرفته هیچ کامی جان از بدن برآید\n" +
                        "\n" +
                        "از حسرتِ دهانش آمد به تنگ جانم\n" +
                        "\t" +
                        "خود کامِ تنگدستان کی زان دهن برآید\n" +
                        "\n" +
                        "گویند ذکرِ خیرش در خیلِ عشقبازان\n" +
                        "\t" +
                        "هر جا که نامِ حافظ در انجمن برآید"
            }
            5 -> {
                rntext = "دل می\u200Cرود ز دستم صاحب\u200Cدلان خدا را\n" +
                        "\t" +
                        "دردا که راز پنهان خواهد شد آشکارا\n" +
                        "\n" +
                        "کشتی\u200Cشکستگانیم ای باد شُرطِه برخیز\n" +
                        "\t" +
                        "باشد که باز بینم دیدار آشنا را\n" +
                        "\n" +
                        "ده\u200Cروزه مِهر گردون، افسانه است و افسون\n" +
                        "\t" +
                        "نیکی به جای یاران فرصت شمار یارا\n" +
                        "\n" +
                        "در حلقهٔ گل\u200C و مُل خوش خواند دوش بلبل\n" +
                        "\t" +
                        "هاتِ الصَّبُوحَ هُبّوا یا ایُّها السُکارا\n" +
                        "\n" +
                        "ای صاحب کرامت شکرانهٔ سلامت\n" +
                        "\t" +
                        "روزی تَفَقُّدی کن درویش بی\u200Cنوا را\n" +
                        "\n" +
                        "آسایش دو گیتی تفسیر این دو حرف است\n" +
                        "\t" +
                        "با دوستان مروت با دشمنان مدارا\n" +
                        "\n" +
                        "در کوی نیک\u200Cنامی ما را گذر ندادند\n" +
                        "\t" +
                        "گر تو نمی\u200Cپسندی تغییر کن قضا را\n" +
                        "\n" +
                        "آن تلخ\u200Cوَش که صوفی ام\u200Cُّالخَبائِثَش خواند\n" +
                        "\t" +
                        "اَشهی لَنا و اَحلی مِن قُبلَةِ العَذارا\n" +
                        "\n" +
                        "هنگام تنگ\u200Cدستی در عیش کوش و مستی\n" +
                        "\t" +
                        "کاین کیمیای هستی قارون کُنَد گدا را\n" +
                        "\n" +
                        "سرکش مشو که چون شمع از غیرتت بسوزد\n" +
                        "\t" +
                        "دلبر که در کف او موم است سنگ خارا\n" +
                        "\n" +
                        "آیینهٔ سکندر، جام می است بنگر\n" +
                        "\t" +
                        "تا بر تو عرضه دارد احوال مُلک دارا\n" +
                        "\n" +
                        "خوبان پارسی\u200Cگو، بخشندگان عمرند\n" +
                        "\t" +
                        "ساقی بده بشارت رندان پارسا را"
            }
            6 -> {
                rntext = "شاه شمشادقدان خسرو شیرین دهنان\n" +
                        "\t" +
                        "که به مژگان شکند قلب همه صف شکنان\n" +
                        "\n" +
                        "مست بگذشت و نظر بر من درویش انداخت\n" +
                        "\t" +
                        "گفت ای چشم و چراغ همه شیرین سخنان\n" +
                        "\n" +
                        "تا کی از سیم و زرت کیسه تهی خواهد بود\n" +
                        "\t" +
                        "بنده من شو و برخور ز همه سیمتنان\n" +
                        "\n" +
                        "کمتر از ذره نه\u200Cای پست مشو مهر بورز\n" +
                        "\t" +
                        "تا به خلوتگه خورشید رسی چرخ زنان\n" +
                        "\n" +
                        "بر جهان تکیه مکن ور قدحی می داری\n" +
                        "\t" +
                        "شادی زهره جبینان خور و نازک بدنان\n" +
                        "\n" +
                        "پیر پیمانه کش من که روانش خوش باد\n" +
                        "\t" +
                        "گفت پرهیز کن از صحبت پیمان شکنان\n" +
                        "\n" +
                        "دامن دوست به دست آر و ز دشمن بگسل\n" +
                        "\t" +
                        "مرد یزدان شو و فارغ گذر از اهرمنان\n" +
                        "\n" +
                        "با صبا در چمن لاله سحر می\u200Cگفتم\n" +
                        "\t" +
                        "که شهیدان که\u200Cاند این همه خونین کفنان\n" +
                        "\n" +
                        "گفت حافظ من و تو محرم این راز نه\u200Cایم\n" +
                        "\t" +
                        "از می لعل حکایت کن و شیرین دهنان"
            }
        }
        return rntext
    }
}